Repository: Victor-FO/FormuLab
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, pt

# appTitle
source: Formula Calculator
de: Formelrechner
es: FormuLab
fr: FormuLab
it: Calcolatrice di Formule
pt: Calculadora de Fórmulas

# homeWelcome
source: Welcome
de: Willkommen
es: Bienvenido
fr: Bienvenue
it: Benvenuto
pt: Bem-vindo

# homeSubtitle
source: Calculator for high school students
de: Rechner für Gymnasiasten
es: Calculadora de fórmulas para estudiantes de instituto
fr: Calculatrice de formules pour les élèves du lycée
it: Calcolatrice per studenti delle superiori
pt: Calculadora para estudantes do ensino médio

# homeFormulasButton
source: View Formulas
de: Formeln Anzeigen
es: Ver Fórmulas
fr: Voir les Formules
it: Visualizza Formule
pt: Ver Fórmulas

# homeFormulasButtonDesc
source: Explore all available formulas
de: Entdecken Sie alle verfügbaren Formeln
es: Explora todas las fórmulas disponibles
fr: Explorez toutes les formules disponibles
it: Esplora tutte le formule disponibili
pt: Explore todas as fórmulas disponíveis

# homeQuickCalcButton
source: Quick Calculator
de: Schnellrechner
es: Calculadora Rápida
fr: Calculatrice Rapide
it: Calcolatrice Rapida
pt: Calculadora Rápida

# homeQuickCalcButtonDesc
source: Direct access to calculators
de: Direkter Zugriff auf Rechner
es: Acceso directo para calcular fórmulas
fr: Accès direct pour calculer des formules
it: Accesso diretto alle calcolatrici
pt: Acesso direto às calculadoras

# homeStartMessage
source: Select an option to start
de: Wählen Sie eine Option, um zu beginnen
es: Selecciona una opción para comenzar
fr: Sélectionnez une option pour commencer
it: Seleziona un'opzione per iniziare
pt: Selecione uma opção para começar

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
pt: Idioma

source: Spanish
de: Spanisch
es: Español
fr: Espagnol
it: Spagnolo
pt: Espanhol

source: English
de: Englisch
es: Inglés
fr: Anglais
it: Inglese
pt: Inglês

source: French
de: Französisch
es: Français
fr: Français
it: Francese
pt: Francês

source: German
de: Deutsch
es: Alemán
fr: Allemand
it: Tedesco
pt: Alemão

source: Italian
de: Italienisch
es: Italiano
fr: Italien
it: Italiano
pt: Italiano

source: Portuguese
de: Portugiesisch
es: Português
fr: Portugais
it: Portoghese
pt: Português

# formulas_searchHint
source: Search formulas...
de: Formeln suchen...
es: Buscar fórmulas...
fr: Rechercher des formules...
it: Cerca formule...
pt: Procurar fórmulas...

# formulas_categoryAll
source: All
de: Alle
es: Todas
fr: Toutes
it: Tutte
pt: Todas

# formulas_categoryESO
source: Middle School
de: Mittelstufe
es: ESO
fr: Collège
it: Scuola Media
pt: Ensino Básico

# formulas_categoryBachillerato
source: High School
de: Oberstufe
es: Bachillerato
fr: Lycée
it: Scuola Superiore
pt: Ensino Médio

# formulas_noFormulasFound
source: No formulas found
de: Keine Formeln gefunden
es: No se encontraron fórmulas
fr: Aucune formule trouvée
it: Nessuna formula trovata
pt: Nenhuma fórmula encontrada

# formula_formula_title
source: Formula
de: Formel
es: Fórmula
fr: Formule
pt: Fórmula

# formula_explanation_title
source: Explanation
de: Erklärung
es: Explicación
fr: Explication
it: Spiegazione
pt: Explicação

# formula_example_title
source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
it: Esempio
pt: Exemplo

# formula_topic_title
source: Topic
de: Thema
es: Tema
fr: Sujet
it: Argomento
pt: Tópico

# calculator_calculate_button
source: Calculate
de: Berechnen
es: Calcular
fr: Calculer
it: Calcolare
pt: Calcular

# calculator_clear_button
source: Clear
de: Löschen
es: Limpiar
fr: Effacer
it: Pulire
pt: Limpar

# calculator_result_title
source: Result
de: Ergebnis
es: Resultado
fr: Résultat
it: Risultato
pt: Resultado

# calculator_calculation_title
source: Calculation Done
de: Berechnung Durchgeführt
es: Cálculo Realizado
fr: Calcul Effectué
it: Calcolo Eseguito
pt: Cálculo Realizado

# calculator_error_invalid_number
source: Invalid number
de: Ungültige Nummer
es: Número inválido
fr: Numéro invalide
it: Numero non valido
pt: Número inválido

# calculator_error_enter_value
source: Please enter a value
de: Bitte geben Sie einen Wert ein
es: Ingresa un valor
fr: Veuillez entrer une valeur
it: Inserisci un valore
pt: Por favor, insira um valor

# pitagoras_title
source: Calculate Pythagorean Theorem
de: Satz des Pythagoras berechnen
es: Calcular Teorema de Pitágoras
fr: Calculer le Théorème de Pythagore
it: Calcolare il Teorema di Pitagora
pt: Calcular o Teorema de Pitágoras

# pitagoras_subtitle
source: Enter two sides to calculate the third.
de: Geben Sie zwei Seiten ein, um die dritte zu berechnen.
es: Introduce dos lados para calcular el tercero.
fr: Entrez deux côtés pour calculer le troisième.
it: Inserisci due lati per calcolare il terzo.
pt: Insira dois lados para calcular o terceiro.

# pitagoras_var_a
source: Side a
de: Kathete a
es: Cateto a
fr: Côté a
it: Cateto a
pt: Cateto a

# pitagoras_var_b
source: Side b
de: Kathete b
es: Cateto b
fr: Côté b
it: Cateto b
pt: Cateto b

# pitagoras_var_c
source: Hypotenuse c
es: Hipotenusa c
fr: Hypoténuse c
it: Ipotenusa c
pt: Hipotenusa c

# pitagoras_i_want_to_calculate
source: I want to calculate:
de: Ich möchte berechnen:
es: Quiero calcular:
fr: Je veux calculer :
it: Voglio calcolare:
pt: Eu quero calcular:

# circulo_title
source: Calculate Area of a Circle
de: Fläche eines Kreises berechnen
es: Calcular Área de un Círculo
fr: Calculer l'Aire d'un Cercle
it: Calcolare l'Area di un Cerchio
pt: Calcular a Área de um Círculo

# circulo_subtitle
source: Enter the radius (r) to calculate the area.
de: Geben Sie den Radius (r) ein, um die Fläche zu berechnen.
es: Introduce el radio (r) para calcular el área.
fr: Entrez le rayon (r) pour calculer l'aire.
it: Inserisci il raggio (r) per calcolare l'area.
pt: Insira o raio (r) para calcular a área.

# circulo_var_r
source: Radius (r)
es: Radio (r)
fr: Rayon (r)
it: Raggio (r)
pt: Raio (r)

# triangulo_title
source: Calculate Area of a Triangle
de: Fläche eines Dreiecks berechnen
es: Calcular Área de un Triángulo
fr: Calculer l'Aire d'un Triangle
it: Calcolare l'Area di un Triangolo
pt: Calcular a Área de um Triângulo

# triangulo_subtitle
source: Enter the base (b) and height (h).
de: Geben Sie die Basis (b) und die Höhe (h) ein.
es: Introduce la base (b) y la altura (h).
fr: Entrez la base (b) et la hauteur (h).
it: Inserisci la base (b) e l'altezza (h).
pt: Insira a base (b) e a altura (h).

# triangulo_var_h
source: Height (h)
de: Höhe (h)
es: Altura (h)
fr: Hauteur (h)
it: Altezza (h)
pt: Altura (h)

# rombo_title
source: Calculate Area of a Rhombus
de: Fläche einer Raute berechnen
es: Calcular Área de un Rombo
fr: Calculer l_Aire d'un Losange
it: Calcolare l'Area di un Rombo
pt: Calcular a Área de um Losango

# rombo_subtitle
source: Enter the diagonals of the rhombus.
de: Geben Sie die Diagonalen der Raute ein.
es: Introduce las diagonales del rombo.
fr: Entrez les diagonales du losange.
it: Inserisci le diagonali del rombo.
pt: Insira as diagonais do losango.

# rombo_var_D
source: Major Diagonal (D)
de: Große Diagonale (D)
es: Diagonal Mayor (D)
fr: Diagonale Majeure (D)
it: Diagonale Maggiore (D)
pt: Diagonal Maior (D)

# rombo_var_d
source: Minor Diagonal (d)
de: Kleine Diagonale (d)
es: Diagonal Menor (d)
fr: Diagonale Mineure (d)
it: Diagonale Minore (d)
pt: Diagonal Menor (d)

# poligono_title
source: Calculate Area of a Regular Polygon
de: Fläche eines Regelmäßigen Polygons berechnen
es: Calcular Área de Polígono Regular
fr: Calculer l'Aire d'un Polygone Régulier
it: Calcolare l'Area di un Poligono Regolare
pt: Calcular a Área de um Polígono Regular

# poligono_subtitle
source: Enter the polygon data.
de: Geben Sie die Polygondaten ein.
es: Introduce los datos del polígono.
fr: Entrez les données du polygone.
it: Inserisci i dati del poligono.
pt: Insira os dados do polígono.

# poligono_var_n
source: Number of sides (n)
de: Anzahl der Seiten (n)
es: Número de lados (n)
fr: Nombre de côtés (n)
it: Numero di lati (n)
pt: Número de lados (n)

# poligono_var_l
source: Length of a side (l)
de: Länge einer Seite (l)
es: Longitud de un lado (l)
fr: Longueur d'un côté (l)
it: Lunghezza di un lato (l)
pt: Comprimento de um lado (l)

# poligono_var_ap
source: Apothem (ap)
de: Apothema (ap)
es: Apotema (ap)
fr: Apothème (ap)
it: Apotema (ap)
pt: Apótema (ap)

# esfera_title
source: Calculate Volume of a Sphere
de: Volumen einer Kugel berechnen
es: Calcular Volumen de una Esfera
fr: Calculer le Volume d'une Sphère
it: Calcolare il Volume di una Sfera
pt: Calcular o Volume de uma Esfera

# esfera_subtitle
source: Enter the radius (r) to calculate the volume.
de: Geben Sie den Radius (r) ein, um das Volumen zu berechnen.
es: Introduce el radio (r) para calcular el volumen.
fr: Entrez le rayon (r) pour calculer le volume.
it: Inserisci il raggio (r) per calcolare il volume.
pt: Insira o raio (r) para calcular o volume.

# esfera_var_r
source: Radius (r)
es: Radio (r)
fr: Rayon (r)
it: Raggio (r)
pt: Raio (r)

# puntos_title
source: Calculate Distance Between Two Points
de: Abstand zwischen Zwei Punkten berechnen
es: Calcular Distancia entre Dos Puntos
fr: Calculer la Distance entre Deux Points
it: Calcolare la Distanza tra Due Punti
pt: Calcular a Distância entre Dois Pontos

# puntos_subtitle
source: Enter the coordinates of the two points.
de: Geben Sie die Koordinaten der beiden Punkte ein.
es: Introduce las coordenadas de los dos puntos.
fr: Entrez les coordonnées des deux points.
it: Inserisci le coordinate dei due punti.
pt: Insira as coordenadas dos dois pontos.

# tales_title
source: Calculate Thales's Theorem
de: Satz des Thales berechnen
es: Calcular Teorema de Tales
fr: Calculer le Théorème de Thalès
it: Calcolare il Teorema di Talete
pt: Calcular o Teorema de Tales

# tales_subtitle
source: Enter three values to calculate the fourth.
de: Geben Sie drei Werte ein, um den vierten zu berechnen.
es: Introduce tres valores para calcular el cuarto.
fr: Entrez trois valeurs pour calculer la quatrième.
it: Inserisci tre valori per calcolare il quarto.
pt: Insira três valores para calcular o quarto.

# tales_var_a
source: Value a
de: Wert a
es: Valor a
fr: Valeur a
it: Valore a
pt: Valor a

# tales_var_b
source: Value b
de: Wert b
es: Valor b
fr: Valeur b
it: Valore b
pt: Valor b

# tales_var_c
source: Value c
de: Wert c
es: Valor c
fr: Valeur c
it: Valore c
pt: Valor c

# tales_var_d
source: Value d
de: Wert d
es: Valor d
fr: Valeur d
it: Valore d
pt: Valor d

# formula_ecuacion_segundo_grado_name
source: Quadratic Equation
de: Quadratische Gleichung
es: Ecuación de Segundo Grado
fr: Équation du Second Degré
it: Equazione di Secondo Grado
pt: Equação do Segundo Grau

# formula_ecuacion_segundo_grado_desc
source: General formula to solve quadratic equations
de: Allgemeine Formel zur Lösung quadratischer Gleichungen
es: Fórmula general para resolver ecuaciones cuadráticas
fr: Formule générale pour résoudre les équations quadratiques
it: Formula generale per risolvere equazioni quadratiche
pt: Fórmula geral para resolver equações quadráticas

# formula_ecuacion_segundo_grado_explanation
source: The general formula to solve quadratic equations is: x = (-b ± √(b² - 4ac)) / 2a Where: • a, b, c are the coefficients of the equation • The discriminant (Δ = b² - 4ac) determines the type of solutions: - If Δ > 0: two distinct real solutions - If Δ = 0: one real solution (double root) - If Δ < 0: no real solutions
de: Die allgemeine Formel zur Lösung quadratischer Gleichungen lautet: x = (-b ± √(b² - 4ac)) / 2a Wo: • a, b, c die Koeffizienten der Gleichung sind • Die Diskriminante (Δ = b² - 4ac) bestimmt die Art der Lösungen: - Wenn Δ > 0: zwei verschiedene reelle Lösungen - Wenn Δ = 0: eine reelle Lösung (doppelte Wurzel) - Wenn Δ < 0: keine reellen Lösungen
es: La fórmula general para resolver ecuaciones de segundo grado es: x = (-b ± √(b² - 4ac)) / 2a Donde: • a, b, c son los coeficientes de la ecuación • El discriminante (Δ = b² - 4ac) determina el tipo de soluciones: - Si Δ > 0: dos soluciones reales distintas - Si Δ = 0: una solución real (raíz doble) - Si Δ < 0: no tiene soluciones reales
fr: La formule générale pour résoudre les équations du second degré est : x = (-b ± √(b² - 4ac)) / 2a Où : • a, b, c sont les coefficients de l'équation • Le discriminant (Δ = b² - 4ac) détermine le type de solutions : - Si Δ > 0 : deux solutions réelles distinctes - Si Δ = 0 : une solution réelle (racine double) - Si Δ < 0 : pas de solutions réelles
it: La formula generale per risolvere le equazioni di secondo grado è: x = (-b ± √(b² - 4ac)) / 2a Dove: • a, b, c sono i coefficienti dell'equazione • Il discriminante (Δ = b² - 4ac) determina il tipo di soluzioni: - Se Δ > 0: due soluzioni reali distinte - Se Δ = 0: una soluzione reale (radice doppia) - Se Δ < 0: nessuna soluzione reale
pt: A fórmula geral para resolver equações de segundo grau é: x = (-b ± √(b² - 4ac)) / 2a Onde: • a, b, c são os coeficientes da equação • O discriminante (Δ = b² - 4ac) determina o tipo de soluções: - Se Δ > 0: duas soluções reais distintas - Se Δ = 0: uma solução real (raiz dupla) - Se Δ < 0: não há soluções reais

# ecuacion_segundo_grado_error_a_zero
source: Incorrect value
de: Fehler: a ist null
es: Valor incorrecto
fr: Erreur : a est nul

# ecuacion_segundo_grado_error_calculating
source: Error calculating
de: Fehler bei der Berechnung
es: Error al calcular
fr: Erreur lors du calcul

# ecuacion_segundo_grado_coef_a
source: Coefficient a
de: Koeffizient a
es: Coeficiente a

# ecuacion_segundo_grado_ej_a
source: Ex(2)
de: Bsp(2)
es: Ej(2)

# ecuacion_segundo_grado_error_a
source: Error in value of a
de: Fehler beim Wert von a
es: Error en el valor de a
fr: Erreur dans la valeur de a

# ecuacion_segundo_grado_coef_b
source: Coefficient b
de: Koeffizient b
es: Coeficiente b

# ecuacion_segundo_grado_ej_bb
source: Ex(3)
de: Bsp(3)
es: Ej(3)

# ecuacion_segundo_grado_error_b
source: Error in value of b
de: Fehler beim Wert von b
es: Error en el valor de b
fr: Erreur dans la valeur de b

# ecuacion_segundo_grado_coef_c
source: Coefficient c
de: Koeffizient c
es: Coeficiente c

# ecuacion_segundo_grado_ej_c
source: Ex(-5)
de: Bsp(-5)
es: Ej(-5)

# ecuacion_segundo_grado_error_c
source: Error in value of c
de: Fehler beim Wert von c
es: Error en el valor de c
fr: Erreur dans la valeur de c

# ecuacion_segundo_grado_discriminante
source: Discriminant
de: Diskriminante
es: Discriminante

# ecuacion_segundo_grado_no_real_solutions
source: No solutions
de: Keine Lösungen
es: No tiene soluciones
fr: Pas de solutions

# formula_teorema_pitagoras_name
source: Pythagorean Theorem
de: Satz des Pythagoras
es: Teorema de Pitágoras
fr: Théorème de Pythagore
it: Teorema di Pitagora
pt: Teorema de Pitágoras

# formula_teorema_pitagoras_desc
source: Relationship between the sides of a right triangle
de: Beziehung zwischen den Seiten eines rechtwinkligen Dreiecks
es: Relación entre los lados de un triángulo rectángulo
fr: Relation entre les côtés d'un triangle rectangle
it: Relazione tra i lati di un triangolo rettangolo
pt: Relação entre os lados de um triângulo retângulo

# formula_teorema_pitagoras_example
source: If a = 3 and b = 4, then c = 5
de: Wenn a = 3 und b = 4, dann ist c = 5
es: Si a = 3 y b = 4, entonces c = 5
fr: Si a = 3 et b = 4, alors c = 5
it: Se a = 3 e b = 4, allora c = 5
pt: Se a = 3 e b = 4, então c = 5

# formula_teorema_pitagoras_explanation
source: In a right triangle, the square of the hypotenuse (c) is equal to the sum of the squares of the other two sides (a and b).
de: In einem rechtwinkligen Dreieck ist das Quadrat der Hypotenuse (c) gleich der Summe der Quadrate der beiden anderen Seiten (a und b).
es: En un triángulo rectángulo, el cuadrado de la hipotenusa (c) es igual a la suma de los cuadrados de los catetos (a y b).
fr: Dans un triangle rectangle, le carré de l'hypoténuse (c) est égal à la somme des carrés des deux autres côtés (a et b).
it: In un triangolo rettangolo, il quadrato dell'ipotenusa (c) è uguale alla somma dei quadrati degli altri due lati (a e b).
pt: Em um triângulo retângulo, o quadrado da hipotenusa (c) é igual à soma dos quadrados dos outros dois lados (a e b).

# formula_area_circulo_name
source: Area of a Circle
de: Fläche eines Kreises
es: Área de un Círculo
fr: Aire d'un Cercle
it: Area di un Cerchio
pt: Área de um Círculo

# formula_area_circulo_desc
source: Formula to calculate the area of a circle
de: Formel zur Berechnung der Fläche eines Kreises
es: Fórmula para calcular el área de un círculo
fr: Formule pour calculer l'aire d'un cercle
it: Formula per calcolare l'area di un cerchio
pt: Fórmula para calcular a área de um círculo

# formula_area_circulo_example
source: If r = 5, then A = π × 25 ≈ 78.54
de: Wenn r = 5, dann ist A = π × 25 ≈ 78.54
es: Si r = 5, entonces A = π × 25 ≈ 78.54
fr: Si r = 5, alors A = π × 25 ≈ 78.54
it: Se r = 5, allora A = π × 25 ≈ 78.54
pt: Se r = 5, então A = π × 25 ≈ 78.54

# formula_area_circulo_explanation
source: The area of a circle is calculated by multiplying π (pi) by the radius squared. π ≈ 3.14159
de: Die Fläche eines Kreises wird berechnet, indem π (Pi) mit dem Quadrat des Radius multipliziert wird. π ≈ 3.14159
es: El área de un círculo se calcula multiplicando π (pi) por el radio al cuadrado. π ≈ 3.14159
fr: L'aire d'un cercle est calculée en multipliant π (pi) par le rayon au carré. π ≈ 3.14159
it: L'area di un cerchio si calcola moltiplicando π (pi greco) per il raggio al quadrato. π ≈ 3.14159
pt: A área de um círculo é calculada multiplicando π (pi) pelo raio ao quadrado. π ≈ 3.14159

# formula_area_triangulo_name
source: Area of a Triangle
de: Fläche eines Dreiecks
es: Área de un Triángulo
fr: Aire d'un Triangle
it: Area di un Triangolo
pt: Área de um Triângulo

# formula_area_triangulo_desc
source: Formula to calculate the area of a triangle
de: Formel zur Berechnung der Fläche eines Dreiecks
es: Fórmula para calcular el área de un triángulo
fr: Formule pour calculer l'aire d'un triangle
it: Formula per calcolare l'area di un triangolo
pt: Fórmula para calcular a área de um triângulo

# formula_area_triangulo_example
source: If the base (b) is 10 and the height (h) is 5, the area is 25
de: Wenn die Basis (b) 10 ist und die Höhe (h) 5 ist, beträgt die Fläche 25
es: Si la base (b) es 10 y la altura (h) es 5, el área es 25
fr: Si la base (b) est 10 et la hauteur (h) est 5, l'aire est 25
it: Se la base (b) è 10 e l'altezza (h) è 5, l'area è 25
pt: Se a base (b) é 10 e a altura (h) é 5, a área é 25

# formula_area_triangulo_explanation
source: The area of a triangle is calculated by multiplying the length of the base (b) by the height (h) and dividing the result by two.
de: Die Fläche eines Dreiecks wird berechnet, indem die Länge der Basis (b) mit der Höhe (h) multipliziert und das Ergebnis durch zwei geteilt wird.
es: El área de un triángulo se calcula multiplicando la longitud de la base (b) por la altura (h) y dividiendo el resultado entre dos.
fr: L'aire d'un triangle est calculée en multipliant la longueur de la base (b) par la hauteur (h) et en divisant le résultat par deux.
it: L'area di un triangolo si calcola moltiplicando la lunghezza della base (b) per l'altezza (h) e dividendo il risultato per due.
pt: A área de um triângulo é calculada multiplicando o comprimento da base (b) pela altura (h) e dividindo o resultado por dois.

# formula_area_rombo_name
source: Area of a Rhombus
de: Fläche einer Raute
es: Área de un Rombo
fr: Aire d'un Losange
it: Area di un Rombo
pt: Área de um Losango

# formula_area_rombo_desc
source: Formula to calculate the area of a rhombus
de: Formel zur Berechnung der Fläche einer Raute
es: Fórmula para calcular el área de un rombo
fr: Formule pour calculer l'aire d'un losange
it: Formula per calcolare l'area di un rombo
pt: Fórmula para calcular a área de um losango

# formula_area_rombo_example
source: If the major diagonal (D) is 8 and the minor diagonal (d) is 6, the area is 24 cm².
de: Wenn die große Diagonale (D) 8 ist und die kleine (d) 6 ist, beträgt die Fläche 24 cm².
es: Si la diagonal mayor (D) es 8 y la menor (d) es 6, el área es 24 cm².
fr: Si la grande diagonale (D) est 8 et la petite (d) est 6, l'aire est 24 cm².
it: Se la diagonale maggiore (D) è 8 e la minore (d) è 6, l'area è 24 cm².
pt: Se a diagonal maior (D) é 8 e a menor (d) é 6, a área é 24 cm².

# formula_area_rombo_explanation
source: The area of a rhombus is calculated by multiplying the major diagonal (D) by the minor diagonal (d) and dividing the result by two.
de: Die Fläche einer Raute wird berechnet, indem die große Diagonale (D) mit der kleinen Diagonale (d) multipliziert und das Ergebnis durch zwei geteilt wird.
es: El área de un rombo se calcula multiplicando la diagonal mayor (D) por la diagonal menor (d) y dividiendo el resultado entre dos.
fr: L'aire d'un losange est calculée en multipliant la grande diagonale (D) par la petite diagonale (d) et en divisant le résultat par deux.
it: L'area di un rombo si calcola moltiplicando la diagonale maggiore (D) per la diagonale minore (d) e dividendo il risultato per due.
pt: A área de um losango é calculada multiplicando a diagonal maior (D) pela diagonal menor (d) e dividindo o resultado por dois.

# formula_area_poligono_regular_name
source: Area of a Regular Polygon
de: Fläche eines Regelmäßigen Polygons
es: Área de Polígono Regular
fr: Aire d'un Polygone Régulier
it: Area di un Poligono Regolare
pt: Área de um Polígono Regular

# formula_area_poligono_regular_desc
source: Formula to calculate the area of a regular polygon
de: Formel zur Berechnung der Fläche eines regelmäßigen Polygons
es: Fórmula para calcular el área de un polígono regular
fr: Formule pour calculer l'aire d'un polygone régulier
it: Formula per calcolare l'area di un poligono regolare
pt: Fórmula para calcular a área de um polígono regular

# formula_area_poligono_regular_example
source: For a pentagon (5 sides) with a side length of 6cm and an apothem of 4.1cm, the Area is (30 × 4.1) / 2 = 61.5 cm²
de: Für ein Fünfeck (5 Seiten) mit einer Seitenlänge von 6cm und einem Apothema von 4.1cm beträgt die Fläche (30 × 4.1) / 2 = 61.5 cm²
es: Para un pentágono (5 lados) de lado 6cm y apotema 4.1cm, el Área es (30 × 4.1) / 2 = 61.5 cm²
fr: Pour un pentagone (5 côtés) avec un côté de 6cm et un apothème de 4.1cm, l'Aire est (30 × 4.1) / 2 = 61.5 cm²
it: Per un pentagono (5 lati) con un lato di 6cm e un apotema di 4.1cm, l'Area è (30 × 4.1) / 2 = 61.5 cm²
pt: Para um pentágono (5 lados) com um lado de 6cm e um apótema de 4.1cm, a Área é (30 × 4.1) / 2 = 61.5 cm²
