Repository: Victor-FO/FormuLab
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, pt

# formula_area_poligono_regular_explanation
source: The area of a regular polygon is calculated with the Perimeter (P) and the Apothem (ap). The perimeter is the number of sides (n) times the length of a side (l). The apothem is the distance from the center to any of the sides.
de: Die Fläche eines regelmäßigen Polygons wird mit dem Umfang (P) und dem Apothema (ap) berechnet. Der Umfang ist die Anzahl der Seiten (n) multipliziert mit der Länge einer Seite (l). Das Apothema ist der Abstand vom Zentrum zu einer der Seiten.
es: El área de un polígono regular se calcula con el Perímetro (P) y la Apotema (ap). El perímetro es el número de lados (n) por la longitud de un lado (l). La apotema es la distancia del centro a cualquiera de los lados.
fr: L'aire d'un polygone régulier est calculée avec le Périmètre (P) et l'Apothème (ap). Le périmètre est le nombre de côtés (n) multiplié par la longueur d'un côté (l). L'apothème est la distance du centre à n'importe lequel des côtés.
it: L'area di un poligono regolare si calcola con il Perimetro (P) e l'Apotema (ap). Il perimetro è il numero di lati (n) moltiplicato per la lunghezza di un lato (l). L'apotema è la distanza dal centro a uno qualsiasi dei lati.
pt: A área de um polígono regular é calculada com o Perímetro (P) e o Apótema (ap). O perímetro é o número de lados (n) vezes o comprimento de um lado (l). O apótema é a distância do centro a qualquer um dos lados.

# formula_volumen_esfera_name
source: Volume of a Sphere
de: Volumen einer Kugel
es: Volumen de una Esfera
fr: Volume d'une Sphère
it: Volume di una Sfera
pt: Volume de uma Esfera

# formula_volumen_esfera_desc
source: Formula to calculate the volume of a sphere
de: Formel zur Berechnung des Volumens einer Kugel
es: Fórmula para calcular el volumen de una esfera
fr: Formule pour calculer le volume d'une sphère
it: Formula per calcolare il volume di una sfera
pt: Fórmula para calcular o volume de uma esfera

# formula_volumen_esfera_example
source: If r = 3, then V = (4/3)π × 27 ≈ 113.10
de: Wenn r = 3, dann ist V = (4/3)π × 27 ≈ 113.10
es: Si r = 3, entonces V = (4/3)π × 27 ≈ 113.10
fr: Si r = 3, alors V = (4/3)π × 27 ≈ 113.10
it: Se r = 3, allora V = (4/3)π × 27 ≈ 113.10
pt: Se r = 3, então V = (4/3)π × 27 ≈ 113.10

# formula_volumen_esfera_explanation
source: The volume of a sphere is calculated by multiplying (4/3)π by the radius cubed.
de: Das Volumen einer Kugel wird berechnet, indem (4/3)π mit dem Kubik des Radius multipliziert wird.
es: El volumen de una esfera se calcula multiplicando (4/3)π por el radio elevado al cubo.
fr: Le volume d'une sphère est calculé en multipliant (4/3)π par le rayon au cube.
it: Il volume di una sfera si calcola moltiplicando (4/3)π per il raggio al cubo.
pt: O volume de uma esfera é calculado multiplicando (4/3)π pelo raio ao cubo.

# formula_distancia_dos_puntos_name
source: Distance Between Two Points
de: Abstand zwischen Zwei Punkten
es: Distancia entre Dos Puntos
fr: Distance entre Deux Points
it: Distanza tra Due Punti
pt: Distância entre Dois Pontos

# formula_distancia_dos_puntos_desc
source: Formula to calculate the distance between two points on a plane
de: Formel zur Berechnung des Abstands zwischen zwei Punkten in einer Ebene
es: Fórmula para calcular la distancia entre dos puntos en el plano
fr: Formule pour calculer la distance entre deux points sur un plan
it: Formula per calcolare la distanza tra due punti su un piano
pt: Fórmula para calcular a distância entre dois pontos em um plano

# formula_distancia_dos_puntos_example
source: P₁(2, 3) and P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5
de: P₁(2, 3) und P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5
es: P₁(2, 3) y P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5
fr: P₁(2, 3) et P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5
it: P₁(2, 3) e P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5
pt: P₁(2, 3) e P₂(5, 7): d = √[(5-2)² + (7-3)²] = √(9+16) = 5

# formula_distancia_dos_puntos_explanation
source: The distance between two points P₁(x₁, y₁) and P₂(x₂, y₂) is calculated using the Pythagorean theorem on the Cartesian plane.
de: Der Abstand zwischen zwei Punkten P₁(x₁, y₁) und P₂(x₂, y₂) wird mit dem Satz des Pythagoras in der kartesischen Ebene berechnet.
es: La distancia entre dos puntos P₁(x₁, y₁) y P₂(x₂, y₂) se calcula usando el teorema de Pitágoras en el plano cartesiano.
fr: La distance entre deux points P₁(x₁, y₁) et P₂(x₂, y₂) est calculée en utilisant le théorème de Pythagore sur le plan cartésien.
it: La distanza tra due punti P₁(x₁, y₁) e P₂(x₂, y₂) si calcola usando il teorema di Pitagora sul piano cartesiano.
pt: A distância entre dois pontos P₁(x₁, y₁) e P₂(x₂, y₂) é calculada usando o teorema de Pitágoras no plano cartesiano.

# formula_teorema_tales_name
source: Thales's Theorem
de: Satz des Thales
es: Teorema de Tales
fr: Théorème de Thalès
it: Teorema di Talete
pt: Teorema de Tales

# formula_teorema_tales_desc
source: Proportionality relationship in the similarity of triangles
de: Verhältnis der Proportionalität bei der Ähnlichkeit von Dreiecken
es: Relación de proporcionalidad en la semejanza de triángulos
fr: Relation de proportionnalité dans la similitude des triangles
it: Rapporto di proporzionalità nella somiglianza dei triangoli
pt: Relação de proporcionalidade na semelhança de triângulos

# formula_teorema_tales_example
source: If a=4, b=2 and c=6, then d=(2*6)/4=3
de: Wenn a=4, b=2 und c=6, dann ist d=(2*6)/4=3
es: Si a=4, b=2 y c=6, entonces d=(2*6)/4=3
fr: Si a=4, b=2 et c=6, alors d=(2*6)/4=3
it: Se a=4, b=2 e c=6, allora d=(2*6)/4=3
pt: Se a=4, b=2 e c=6, então d=(2*6)/4=3

# formula_teorema_tales_explanation
source: Thales's theorem states that if two intersecting lines are cut by parallel lines, the segments that are formed are proportional. In the context of similar triangles, if we have a large triangle with sides A and C, and a smaller triangle inside with corresponding sides B and D, the relationship holds: A/B = C/D.
de: Der Satz des Thales besagt, dass wenn zwei sich schneidende Linien von parallelen Linien geschnitten werden, die gebildeten Segmente proportional sind. Im Kontext ähnlicher Dreiecke, wenn wir ein großes Dreieck mit den Seiten A und C haben, und ein kleineres Dreieck innen mit den entsprechenden Seiten B und D, bleibt das Verhältnis bestehen: A/B = C/D.
es: El teorema de Tales establece que si dos rectas secantes son cortadas por rectas paralelas, los segmentos que se forman son proporcionales. En el contexto de triángulos semejantes, si tenemos un triángulo grande con lados A y C, y un triángulo más pequeño dentro con lados B y D correspondientes, la relación se mantiene: A/B = C/D.
fr: Le théorème de Thalès énonce que si deux droites sécantes sont coupées par des droites parallèles, les segments qui sont formés sont proportionnels. Dans le contexte de triangles similaires, si nous avons un grand triangle avec les côtés A et C, et un plus petit triangle à l'intérieur avec les côtés correspondants B et D, la relation est maintenue: A/B = C/D.
it: Il teorema di Talete afferma che se due rette incidenti sono tagliate da rette parallele, i segmenti che si formano sono proporzionali. Nel contesto di triangoli simili, se abbiamo un triangolo grande con i lati A e C, e un triangolo più piccolo all'interno con i lati corrispondenti B e D, la relazione vale: A/B = C/D.
pt: O teorema de Tales afirma que se duas retas concorrentes são cortadas por retas paralelas, os segmentos formados são proporcionais. No contexto de triângulos semelhantes, se temos um triângulo grande com lados A e C, e um triângulo menor dentro com lados correspondentes B e D, a relação se mantém: A/B = C/D.

# triangulo_var_b
source: Base (b)
de: Basis (b)

# ecuacion_segundo_grado_double_root
source: (double root)
de: (doppelte Wurzel)
fr: (racine double)
